{"generatedBy": "keras v2.2.4", "modelTopology": {"model_config": {"config": {"layers": [{"config": {"dtype": "float32", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 96, 96, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 32, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "padding": "same", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "padding": "same", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 96, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_3", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "name": "conv2d_4", "padding": "same", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 128, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_4", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_5", "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 5, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}, "keras_version": "2.2.4", "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [5, 5, 3, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [96], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 96, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [4608, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [512, 5], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [5], "name": "dense_2/bias"}], "paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"]}]}